cases/Adina_cases/modified_H2_50k/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00015;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.1;
        value           uniform 0.00015;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.00015;
        value           uniform 0.00015;
    }
    wallPipe
    {
        type            kqRWallFunction;
        value           uniform 0.00015;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    internalWalls
    {
        type            empty;
    }
}


// ************************************************************************* //
