cases/Adina_cases/modified_H2_50k/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         multiComponentMixture;  //singleStepReactingMixture;
    transport       const;
    thermo          hTabulated;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}

species
(
    air
    H2
);
inertSpecie air;

air  //GRI3.0
{
    specie
    {
        molWeight       28.850334; 
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 3.001379e+00 1.486950e-03 -6.082690e-07 1.237554e-10 -9.886221e-15 -9.575864e+02 5.869796e+00 );
        lowCpCoeffs     ( 3.400271e+00 4.831955e-04 -1.063012e-06 2.423725e-09 -1.250252e-12 -1.029939e+03 3.888906e+00 );
    }
    transport
    {
        As              1.459e-06; //Frank White 2006, 190 - 2000 K, As corrected using OF model
        Ts              111;
    }
}

H2
{
    
	specie
    {
        molWeight       2.01588;    // Molecular weight in g/mol
    }
	equationOfState
	{
		R				4124;	// J/kg/K
	}
	
    thermodynamics
    {
        Tlow            50;
        Thigh           300;
        
		values
		(
			(50   0.0        6800)
            (70   170000     7700)
            (90   380000     8800)
            (110  630000     9900)
            (130  920000     10850)
            (150  1250000    11500)
            (170  1620000    11950)
            (190  2030000    12300)
            (210  2480000    12700)
            (230  2970000    13100)
            (250  3500000    13500)
            (270  4070000    13950)
            (290  4680000    14400)
            (300  5000000    14600)
        );
    }
	
    transport
    {
        mu              8e-6;
        Pr              0.7;
    }
}


// ************************************************************************* //
