cases/Adina_cases/modified_H2_50k/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         300; //1.0;

deltaT          1e-4;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      10;

writeFormat     binary;  //faster, less space

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           1.0; //1;

functions
{
    probes_H2_vertical
    {
        type            probes;
        libs            (sampling);
        writeControl    runTime;//writeTime;
        writeInterval   0.1;
        probeLocations
        (
        ( 0 0 0.10 )     // 00
		( 0 0 0.20 )     // 01
		( 0 0 0.30 )     // 02
		( 0 0 0.40 )     // 03
		( 0 0 0.50 )     // 04
        );
        fields          (H2 Qdot T p U);
    }
	
	 myResiduals
    {
        type            solverInfo;
        libs            ("libutilityFunctionObjects.so");

        executeControl  timeStep;
        executeInterval 100;      // Sample less frequently

        writeControl    timeStep;
        writeInterval   100;      // Write every 100 timesteps
                                  
        // List the fields to monitor (add more as needed)
        fields          (p U k epsilon h H2);

        // Optional: Set to 'yes' to also output residual fields to time directories
        // writeResidualFields yes;

        // Optional: Control when to execute (defaults to timeStep if unspecified)
        // executeControl  timeStep;
        // executeInterval 1;
    }
}
// ************************************************************************* //
